Revit 2027 API
ConnectionInputPoint Constructor
Overload List
Name | Description
ConnectionInputPoint() |  Construct a default input point.
ConnectionInputPoint(XYZ) |  Construct an input point from 3d point. A new valid id will be auto-generated.
ConnectionInputPoint(XYZ, Guid) |  Construct an input point from 3d point and id.
Top
See Also
Reference
ConnectionInputPoint Class
Autodesk.Revit.DB.Structure Namespace